Repository: LuicdLabs/OneMMC
Catalog: src/OneMMC/Strings/*/TPM.resw
Source language: en_us
Languages: zh_tw

# TPM_StatusDescription
source: Trusted Platform Module (TPM) information
zh_tw: 信賴平台模組 (TPM) 資訊

# TPM_StatusHeader
source: TPM status
zh_tw: TPM 狀態

# TPM_VersionHeader
source: TPM version
zh_tw: TPM 版本

# TPM_ManufacturerNameHeader
source: Manufacturer name
zh_tw: 製造廠商名稱

# TPM_ManufacturerVersionHeader
source: Manufacturer version
zh_tw: 製造廠商版本

# TPM_SpecificationVersionHeader
source: Specification version
zh_tw: 規格版本

# TPM_ReadyHeader
source: TPM ready
zh_tw: TPM 已就緒

# TPM_EnabledHeader
source: TPM enabled
zh_tw: TPM 已啟用

# TPM_ActivatedHeader
source: TPM activated
zh_tw: TPM 已啟動

# TPM_OwnedHeader
source: Owner set
zh_tw: 擁有者已設定

# TPM_ActionsHeader
source: TPM actions
zh_tw: TPM 動作

# TPM_OpenConsoleHeader
source: Open TPM management console
zh_tw: 開啟 TPM 管理主控台

# TPM_OpenConsoleDescription
source: Launch Windows TPM management console (tpm.msc)
zh_tw: 啟動 Windows TPM 管理主控台 (tpm.msc)

# TPM_RefreshStatusHeader
source: Refresh TPM status
zh_tw: 重新整理 TPM 狀態

# TPM_RefreshStatusDescription
source: Update TPM information
zh_tw: 更新 TPM 資訊

# TPM_ClearTPMHeader
source: Clear TPM
zh_tw: 清除 TPM

# TPM_ClearTPMDescription
source: Clear TPM security hardware (requires restart and confirmation steps)
zh_tw: 清除 TPM 安全性硬體（需要重新啟動並執行確認步驟）

# TPM_AboutHeader
source: About TPM
zh_tw: 關於 TPM

# TPM_WhatIsTPMHeader
source: What is Trusted Platform Module?
zh_tw: 何謂信賴平台模組？

# TPM_WhatIsTPMDescription
source: A Trusted Platform Module (TPM) is a microchip designed to provide basic security-related functions, primarily involving encryption keys. TPMs are usually installed on the computer's motherboard and communicate with the rest of the system using a hardware bus. Computers integrated with TPM can create cryptographic keys and encrypt them so that they can only be decrypted by the TPM. This process is called wrapping or binding the keys.
zh_tw: 信賴平台模組 (TPM) 是一種微晶片，旨在提供基本的安全性相關功能，主要涉及加密金鑰。TPM 通常安裝在電腦的主機板上，並使用硬體匯流排與系統的其餘部分通訊。整合 TPM 的電腦可建立加密金鑰，並將金鑰加密，以便只有 TPM 可將其解密。此程序稱為 wrapping 或 binding 金鑰。

# TPM_Loading
source: Loading...
zh_tw: 正在載入...

# TPM_Success
source: Success
zh_tw: 成功

# TPM_Error
source: Error
zh_tw: 錯誤

# TPM_CannotOpenConsole
source: Unable to open TPM management console
zh_tw: 無法開啟 TPM 管理主控台

# TPM_Warning
source: Warning
zh_tw: 警告

# TPM_CannotGetInfo
source: Unable to get complete TPM information
zh_tw: 無法取得完整 TPM 資訊

# TPM_ClearTPMTitle
source: Clear TPM
zh_tw: 清除 TPM

# TPM_ClearTPMMessage
source: Please execute PowerShell command with admin privileges: Clear-Tpm, or use TPM management console to clear.
zh_tw: 請使用管理員權限執行 PowerShell 命令: Clear-Tpm，或使用 TPM 管理主控台進行清除操作。

# TPM_ClearTPMConfirmMessage
source: Are you sure you want to clear the TPM? This will remove keys stored by the TPM and may require a restart and firmware confirmation.
zh_tw: 確定要清除 TPM 嗎？此操作會移除 TPM 內的金鑰，可能需要重新啟動並在韌體中執行確認。

# TPM_ClearTPMConfirmPrimary
source: Clear
zh_tw: 清除

# TPM_ClearTPMConfirmCancel
source: Cancel
zh_tw: 取消

# TPM_NoXamlRootError
source: Unable to show confirmation dialog: XamlRoot is not available.
zh_tw: 無法顯示確認對話框：XamlRoot 不可用。

# TPM_ClearTPMStarted
source: Clear operation started. The system may need to restart to complete the operation.
zh_tw: 已開始清除作業。系統可能需要重新啟動以完成此操作。

# TPM_ClearTPMSucceeded
source: TPM cleared successfully. A restart may be required.
zh_tw: 已成功清除 TPM。可能需要重新啟動系統。

# TPM_ClearTPMRequiresAdmin
source: Clearing TPM requires administrator privileges.
zh_tw: 清除 TPM 需要系統管理員權限。

# TPM_ClearTPM_NoWin32Tpm
source: Win32_Tpm object not found (TPM info not available via WMI).
zh_tw: 找不到 Win32_Tpm 物件 (WMI 無法提供 TPM 資訊)。

# TPM_ClearTPM_NoMethod
source: No suitable WMI method found to clear the TPM on this system.
zh_tw: 系統上的 WMI 未提供可用於清除 TPM 的方法。

# TPM_ClearTPM_NeedsParameters
source: Found TPM clear method that requires input parameters; cannot invoke automatically.
zh_tw: 找到需要輸入參數的 TPM 清除方法，無法自動呼叫。

# TPM_ClearTPM_InvokeFailed
source: Failed to invoke WMI method to clear TPM: {0}
zh_tw: 呼叫 WMI 清除 TPM 方法失敗：{0}

# TPM_ClearTPMError
source: Error occurred while clearing TPM
zh_tw: 清除 TPM 時發生錯誤

# TPM_VersionFormat
source: (Manufacturer: {0})
zh_tw: (製造商: {0})

# TPM_NotAvailable
source: TPM is not available on this system
zh_tw: 此系統上無可用的 TPM

# TPM_AccessDenied
source: TPM access denied — administrator privileges required
zh_tw: TPM 存取被拒——需要系統管理員權限

# TPM_ClearAllMethodsFailed
source: Unable to clear TPM: all clear methods have failed. Please ensure you have administrator privileges or try clearing TPM in BIOS/UEFI.
zh_tw: 無法清除 TPM：所有清除方法均失敗。請確保您擁有系統管理員權限，或嘗試在 BIOS/UEFI 中清除 TPM。

# TPM_WmiAccessDenied
source: Access to WMI denied, administrator privileges required.
zh_tw: WMI 存取被拒，需要系統管理員權限。
